# *Hourly Mean Temperature data*

In [1]:
import os
from pandas import *
import numpy as np
import pandas as pd
import plotly.express as px
import matplotlib.pyplot as plt
%matplotlib inline
import numpy as np
import datetime as datetime
from timeseries_writer import *
oms_project_path = os.getcwd()

In [5]:
os.chdir(oms_project_path+"/SpikeII")
#os.listdir()

### Open dataset

In [7]:
df_15min = pd.read_csv('AirTemperature15m.csv',skiprows=6,parse_dates=[1])
df_15min = df_15min.drop(['Format'],axis=1) 
df_15min.columns = ['Time','Temp']
df_15min.set_index('Time',inplace=True)
df_15min

                      Temp
Time
2018-05-10 00:00:00  11.69
2018-05-10 00:15:00  11.52
2018-05-10 00:30:00  11.58
2018-05-10 00:45:00  11.72
2018-05-10 01:00:00  11.69
...                    ...
2018-07-01 22:45:00  25.04
2018-07-01 23:00:00  24.78
2018-07-01 23:15:00  24.52
2018-07-01 23:30:00  24.25
2018-07-01 23:45:00  24.06

[5088 rows x 1 columns]

### Extracting dataset

If you want to select data by time, use this code

#crei una serie temporale con le date orarie
date_rng=pd.date_range(start='2018-05-10 00:00',end='2018-07-01 00:00',freq='1H')

#crei il dataframe con le date
df_dates = pd.DataFrame({'Time': date_rng})
df_dates.set_index('Time',inplace=True)

#estrai dal dataframe di 15 min le date che ti servono
df_dates = df_dates.join(df_15min, how='inner')
df_dates.head()

If you want to create an hourly time series using the mean:

In [9]:
df=df_15min.resample('1H').mean()
df

                        Temp
Time
2018-05-10 00:00:00  11.6275
2018-05-10 01:00:00  11.7950
2018-05-10 02:00:00  11.1975
2018-05-10 03:00:00  10.9350
2018-05-10 04:00:00  11.3400
...                      ...
2018-07-01 19:00:00  29.3475
2018-07-01 20:00:00  28.3725
2018-07-01 21:00:00  26.4875
2018-07-01 22:00:00  25.3300
2018-07-01 23:00:00  24.4025

[1272 rows x 1 columns]

In [10]:
ID_basin = 1

In [11]:
df.reset_index(inplace=True)
df

                    Time     Temp
0    2018-05-10 00:00:00  11.6275
1    2018-05-10 01:00:00  11.7950
2    2018-05-10 02:00:00  11.1975
3    2018-05-10 03:00:00  10.9350
4    2018-05-10 04:00:00  11.3400
...                  ...      ...
1267 2018-07-01 19:00:00  29.3475
1268 2018-07-01 20:00:00  28.3725
1269 2018-07-01 21:00:00  26.4875
1270 2018-07-01 22:00:00  25.3300
1271 2018-07-01 23:00:00  24.4025

[1272 rows x 2 columns]

In [12]:
df.insert(loc=0, column='-', value=np.nan)
df.head()

    -                Time     Temp
0 NaN 2018-05-10 00:00:00  11.6275
1 NaN 2018-05-10 01:00:00  11.7950
2 NaN 2018-05-10 02:00:00  11.1975
3 NaN 2018-05-10 03:00:00  10.9350
4 NaN 2018-05-10 04:00:00  11.3400

In [13]:
write_timeseries_csv(df,'AirTemperature1h',ID_basin)

***SUCCESS writing!  AirTemperature1h